{"meta":{"title":"Tiffany's Blog","subtitle":"Sharing work experiences and learning journey","description":"Sharing experiences and learning from work as an business-graduated engineer","author":"YUNCHENLI","url":"https://yunchenli.github.io/hexotestsite","root":"/hexotestsite/"},"pages":[{"title":"Resume","date":"2022-09-04T08:21:01.000Z","updated":"2022-09-04T08:25:01.372Z","comments":true,"path":"About/index.html","permalink":"https://yunchenli.github.io/hexotestsite/About/index.html","excerpt":"","text":"YUN-CHEN, LI(Tiffany) Technical Project Manager&#x2F;Data Analyst5 years working experiences in semiconductor and IC design field with 3+ years experiences of leading key projects under NPI&#x2F;MP and rich domain knowledge of operational process, hardware architecture and lifecycle, and system administration. Well-versed in the negotiation with cross-functional teams and scheduling on-boarding projects to drive operational optimization and business growth. Skills Data Visualization Programming Language Design Thinking Power BI, Tableau, Spotfire, R Python, Linux, HTML, CSS, MySQL, VBA Storytelling, Brainstorming, ORID, Customer journey Soft Skills Logistic and statistical Project management, Quality analysis (IPQC), Yield optimization, System integration, Troubleshooting, Time management, Cross-functional negotiation Quantitative and Qualitative analysis, Fuzzy-set Certificate Google Technical Support Fundamentals (2020) Google IT Automation with Python (2020) Kaggle Certificate – Intro of Python&#x2F;Intermediate Machine Learning&#x2F;Pandas (2021) ExperienceLenovo Chromebook Lead of Software Project Manager (MP) – Lenovo LCFC 2020&#x2F;09 – 2021&#x2F;08#Project management #Chrome OS #RMA #Operation management #Linux #Production analysis #MP Lead 16+ MP projects on maintaining 2nd source change and software change (firmware&#x2F;image&#x2F;hardware ID) assessment and troubleshooting on RMA (return merchandize authorization) products; handling 175+ issues within a quarter. Familiar with domain knowledge in typical hardware architecture and operation (BOMs), process documentation, assembly and test processes (Linux-based). Global RMA and Chrome OS training speaker for Lenovo 300+ front-end engineer in EMEA(Europe) regions. Formulate specifications and responsible as software focal of global RMA process, total solved ratio: 82%. Coordinate with all function teams to optimize FRU production line and outsourcing projects. Controlling and monitoring issues of TNB lifecycle with backlog notification and schedule tracking. System Analyst – Qualcomm 2019&#x2F;05 – 2020&#x2F;08#Project management #System integration #MP #IT #Supply chain management #Quality management Ensure quality of data completeness under production (WS&#x2F;FT), supplier data connection infrastructures and technical specification documents with MySQL, Hadoop, Spotfire for system analysis on maintaining yield (IPQC) and visualized data with Tableau, R, PowerBI, Spotfire Schedule 700+ tester upgrade plan (Advantest&#x2F;Teradyne) and on-boarding engineering projects&#x2F;business transaction across 16+ SATs, coverage rate is over 95% within three months. Responsible for fulfilling all internal end user IT needs (Inbound&#x2F;outbound operation) and drive production yields with cross-functional teams and track the validation results of products. Trouble-shooting and problem-solving skills to enhance supplier process, resolve production data quality issue and ensure supplier data deliverable meet specifications, also design and formulate process specifications. Technical project management of infrastructure deployment streams, including management of internal project resources and external vendors, including ink-off plan to improve production yield at TSMC… NPI Project Manager&#x2F;Data Engineer – Himax 2017&#x2F;03 – 2019&#x2F;04#Project management #Operation management #Quality analysis #Data visualization #NPI Define, drive, and manage the overall NPI project from RD and quality perspective across EVT&#x2F;DVT&#x2F;PVT phases. Analyze NPI data with R&#x2F;Minitab for data visualization, MATLAB for defect simulation, VBA for fab optimization, DPPM correlation and product correlation between system and ATE troubleshooting on different failure mode and test coverage improvement, QC tooling: 8D, MSA, Ishikawa, PDCA, SPC, quality testing (heat soak testing). Familiar with factory and operation process flow including AR coating, imprinting, dicing…, measurement instruments (AOI, Nikon, SEM…) of wire bond, SMT, also focus on DOE design. Collecting wafer defect data automatically and analyzing defect consistence to optimize production process. Increased efficiency by 90%. User Experience Engineer (Internship) – HTC 2016&#x2F;07 – 2016&#x2F;08#User Research #UX&#x2F;UI #Data visualization Analyze tech user’s using behavior with qualitative and quantitative methods and find out user’s insights and pain points, Tools: Tableau (data visualization), Excel, R (word cloud, data visualization and clustering users) EducationMaster - Department of Service Science at National Tsing-Hua University Dedicated in business analysis and information technology with human-oriented design thinking methods. My thesis: “Comparing fs&#x2F;QCA and PLS-PM models: Exploring the relationship between threats to technological self-esteem and opposition to alternative technologies”Kaggle.com, Google - Predict Repeat Restaurant Bookings Competition"}],"posts":[{"title":"Hello World","slug":"hello-world","date":"2022-09-04T03:26:41.761Z","updated":"2022-09-04T03:26:41.761Z","comments":true,"path":"2022/09/04/hello-world/","link":"","permalink":"https://yunchenli.github.io/hexotestsite/2022/09/04/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[]}